// 3.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <string>
#include<math.h>

using namespace std;

int main()
{

	int A, B, X;
	setlocale(LC_ALL, "Rus");

	cout << "Введите число X = ";
	cin >> X;
	switch (X)
	{
	case 10:cout << ("десять учебных задании");
		break;
	case	11:cout << ("одиннадцать учебных задании"); break;
	case	12:cout << ("двенадцать учебных задании "); break;
	case	13:cout << ("тринадцать учебных задании "); break;
	case	14:cout << ("четырнадцать учебных задании "); break;
	case	15:cout << ("пятнадцать учебных задании "); break;
	case	16:cout << ("шестнадцать учебных задании "); break;
	case	17:cout << ("семнадцать учебных задании "); break;
	case	18:cout << ("восемнадцать учебных задании "); break;
	case	19:cout << ("девятнадцать учебных задании "); break;
	case	20:cout << ("двадцать учебных задании "); break;
	case	21:cout << ("двадцать одно учебное задание "); break;
	case	22:cout << ("двадцать два учебных задания"); break;
	case	23:cout << ("двадцать три учебных задания"); break;
	case	24:cout << ("двадцать четыре учебных задания"); break;
	case	25:cout << ("двадцать пять учебных задания "); break;
	case	26:cout << ("двадцать шесть учебных задания "); break;
	case	27:cout << ("двадцать семь учебных задания "); break;
	case	28:cout << ("двадцать восемь учебных задания "); break;
	case	29:cout << ("двадцать девять учебных задания "); break;
	case	30:cout << ("тридцать учебных задании "); break;
	case	31:cout << ("тридцать одно учебное задание "); break;
	case	32:cout << ("тридцать два учебных задания "); break;
	case	33:cout << ("тридцать три учебных задании"); break;
	case	34:cout << ("тридцать четыре учебных задания"); break;
	case	35:cout << ("тридцать пять учебных задании"); break;
	case	36:cout << ("тридцать шесть учебных задании "); break;
	case	37:cout << ("тридцать семь учебных задании "); break;
	case	38:cout << ("тридцать восемь учебных задании "); break;
	case	39:cout << ("тридцать девять учебных задании "); break;
	case	40:cout << ("сорок учебных задании "); break;
	}
	return 0;
}