// 4.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
#include <iostream>
#include <string>
#include<math.h>
using namespace std;

int main()
{
	int A, B, C;
	setlocale(LC_ALL, "rus");
	string one[] = { "Сто","Двести","Триста","Четыреста","Пятьсот","Шестьсот","Семьсот","Восемьсот","Девятьсот" };
	string two[] = { "десять" , "двадцать" , "тридцать", "сорок"," пятьдесят" , "шестьдесят" , "семьдесят", "восемьдесят" , "девяносто" };
	string three[] = { "один","два","три","четыре","пять","шесть","семь","восемь","девять" };
	string four[] = { "одиннадцать" , "двенадцать ", "тринадцать ", "четырнадцать ", "пятнадцать ", "шестнадцать ", "семнадцать" , "восемнадцать ","девятнадцать" };
	cout << "Введите число =  ";
	cin >> A;
	if (A > 99 and A < 1000)
	{
		if (A / 10 % 10 >= 2)
			cout << one[A / 100 - 1] << " " << two[A / 10 % 10 - 1] << " " << three[A % 10 - 1];
		else
			if (A / 10 % 10 == 0)
				cout << one[A / 100 - 1] << " " << three[A % 10 - 1];
			else
				cout << one[A / 100 - 1] << " " << four[A % 10 - 1];
	}
	return 0;
}

		
	