// 5.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <string>
#include<math.h>
using namespace std;
int main()
{
	
	int A, B, C;

	setlocale(LC_ALL, "rus");
	string one[] = { "зеленой ","красной","желтой","белой","чёрной" };
	string two[] = { "обезьяны" , "курицы" , "собаки", "свиньи"," крысы" , "коровы" , "тигра", "зайца" , "дракона" , "змеи" , "лошади" , "овцы" };
	string three[] = { "зеленого","красного","желтого","белого","черного" };
	string four[] = { "одиннадцать" , "двенадцать ", "тринадцать ", "четырнадцать ", "пятнадцать ", "шестнадцать ", "семнадцать" , "восемнадцать ","девятнадцать" };
	cout << "Введите число =  ";
	cin >> A;
	if (A >= 0)
	{
		A = A % 60;
		B = A / 12;
		A = A % 12;
		
		if (A!=0 and(A < 6 or A>8) )
			cout << "год " << one[B] << " " << two[A];
			else if(A!=0)
			cout << "год " << three[B] << " " << two[A];
		if (A == 0)
			cout << "год " << one[B ] << " " << two[0];
	}
	return 0;
}


